#+TITLE:         The Analytical Edge. Final Evaluation
#+AUTHOR:        Sergio-Feliciano Mendoza-Barrera
#+DRAWERS:       sfmb
#+EMAIL:         smendoza.barrera@gmail.com
#+DATE:          14/08/2015
#+DESCRIPTION:   Final exam of The Analytical Edge
#+KEYWORDS:      R, data science, emacs, ESS, org-mode, final
#+LANGUAGE:      en
#+OPTIONS:       H:10 num:t toc:nil \n:nil @:t ::t |:t ^:{} -:t f:t *:t <:t d:HIDDEN
#+OPTIONS:       TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:       LaTeX:dvipng
#+INFOJS_OPT:    view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:
#+STYLE: <link rel="stylesheet" type="text/css" href="dft.css"/>

#+LaTeX_CLASS: IEEEtran
#+LATEX_CLASS_OPTIONS: [letterpaper, 9pt, onecolumn, twoside, technote, final]
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{makeidx}

#+LATEX_HEADER: \usepackage[lining,tabular]{fbb} % so math uses tabular lining figures
#+LATEX_HEADER: \usepackage[scaled=.95,type1]{cabin} % sans serif in style of Gill Sans
#+LATEX_HEADER: \usepackage[varqu,varl]{zi4}% inconsolata typewriter
#+LATEX_HEADER: \usepackage[T1]{fontenc} % LY1 also works
#+LATEX_HEADER: \usepackage[libertine,bigdelims]{newtxmath}
#+LATEX_HEADER: \usepackage[cal=boondoxo,bb=boondox,frak=boondox]{mathalfa}
#+LATEX_HEADER: \useosf % change normal text to use proportional oldstyle figures

#+LATEX_HEADER: \markboth{The Analytical Edge. Final Evaluation}%
#+LATEX_HEADER: {Sergio-Feliciano Mendoza-Barrera}

#+LATEX_HEADER: \newcommand{\degC}{$^\circ$C{}}

#+STYLE: <script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"> </script>

#+ATTR_HTML: width="500px"

# -*- mode: org; -*-
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
** DONE Problem 1 - Loading the Data (2 points possible)
CLOSED: [2015-08-22 Sat 04:59]

Load the dataset Movies.csv into R and call it "Movies". In this
problem, we will build a model to predict worldwide box office revenue
for movies made in 2010-2015.

#+begin_src R :session :results output :exports all
  library(parallel)

  if(!file.exists("../data")) {
          dir.create("../data")
  }

  fileUrl <- "https://courses.edx.org/asset-v1:MITx+15.071x_2a+2T2015+type@asset+block/Movies.csv"
  fileName <- "MoviesP1Final.csv"
  dataPath <- "../data"

  filePath <- paste(dataPath, fileName, sep = "/")

  if(!file.exists(filePath)) {
          download.file(fileUrl, destfile = filePath, method = "curl")
  }

  writeLines("\n :: File downloaded...")
#+end_src

#+RESULTS:
:
:  :: File downloaded...

Create a training set that consists of movies released before 2010 and
a testing set that consists of movies released in 2010 and after.

#+begin_src R :session :results output :exports all
  writeLines("\n :: Loading data into their data frame.")
  Movies <- read.csv("../data/MoviesP1Final.csv")
  str(Movies)
#+end_src

#+RESULTS:
#+begin_example

 :: Loading data into their data frame.
'data.frame':	334 obs. of  24 variables:
 $ Name             : Factor w/ 334 levels "2 Fast 2 Furious",..: 28 32 31 29 30 247 248 4 5 6 ...
 $ Year             : int  1989 1992 1995 1997 2005 2008 2012 2002 2006 2014 ...
 $ Rated            : Factor w/ 6 levels "Approved","G",..: 5 5 5 5 5 3 5 6 6 6 ...
 $ Runtime          : int  126 126 121 125 140 152 165 113 117 102 ...
 $ Action           : int  1 1 1 1 1 1 1 0 1 1 ...
 $ Adventure        : int  1 0 1 0 1 0 0 0 0 0 ...
 $ Crime            : int  0 0 0 0 0 1 0 0 0 0 ...
 $ Drama            : int  0 0 0 0 0 1 0 0 0 1 ...
 $ Thriller         : int  0 0 0 0 0 0 1 0 0 0 ...
 $ Fantasy          : int  0 0 1 0 0 0 0 0 1 1 ...
 $ Horror           : int  0 0 0 0 0 0 0 1 0 0 ...
 $ Sci.Fi           : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Comedy           : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Family           : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Mystery          : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Romance          : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Animation        : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Music            : int  0 0 0 0 0 0 0 0 0 0 ...
 $ History          : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Documentary      : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Wins             : int  10 2 9 5 15 134 43 10 12 0 ...
 $ Nominations      : int  21 16 20 20 49 106 83 25 30 6 ...
 $ Production.Budget: num  18.1 18.9 19.1 19.2 19.1 ...
 $ Worldwide        : num  20.6 20.1 20.3 19.9 20 ...
#+end_example

Lets change the the type of the ~Name~ feature to a character R type.

#+begin_src R :session :results output :exports all
  writeLines("\n :: Converting the name to a character type...")
  Movies$Name <- as.character(Movies$Name)
  summary(Movies)
#+end_src

#+RESULTS:
#+begin_example

 :: Converting the name to a character type...
     Name                Year           Rated        Runtime
 Length:334         Min.   :1953   Approved:  1   Min.   : 72.0
 Class :character   1st Qu.:2001   G       : 11   1st Qu.: 94.0
 Mode  :character   Median :2005   N/A     :  8   Median :108.0
                    Mean   :2004   PG      : 77   Mean   :112.1
                    3rd Qu.:2010   PG-13   :139   3rd Qu.:125.8
                    Max.   :2015   R       : 98   Max.   :201.0
     Action        Adventure         Crime            Drama
 Min.   :0.000   Min.   :0.000   Min.   :0.0000   Min.   :0.00000
 1st Qu.:0.000   1st Qu.:0.000   1st Qu.:0.0000   1st Qu.:0.00000
 Median :1.000   Median :0.000   Median :0.0000   Median :0.00000
 Mean   :0.515   Mean   :0.491   Mean   :0.1287   Mean   :0.08982
 3rd Qu.:1.000   3rd Qu.:1.000   3rd Qu.:0.0000   3rd Qu.:0.00000
 Max.   :1.000   Max.   :1.000   Max.   :1.0000   Max.   :1.00000
    Thriller         Fantasy           Horror           Sci.Fi
 Min.   :0.0000   Min.   :0.0000   Min.   :0.0000   Min.   :0.0000
 1st Qu.:0.0000   1st Qu.:0.0000   1st Qu.:0.0000   1st Qu.:0.0000
 Median :0.0000   Median :0.0000   Median :0.0000   Median :0.0000
 Mean   :0.1737   Mean   :0.1647   Mean   :0.1377   Mean   :0.1946
 3rd Qu.:0.0000   3rd Qu.:0.0000   3rd Qu.:0.0000   3rd Qu.:0.0000
 Max.   :1.0000   Max.   :1.0000   Max.   :1.0000   Max.   :1.0000
     Comedy           Family          Mystery           Romance
 Min.   :0.0000   Min.   :0.0000   Min.   :0.00000   Min.   :0.0000
 1st Qu.:0.0000   1st Qu.:0.0000   1st Qu.:0.00000   1st Qu.:0.0000
 Median :0.0000   Median :0.0000   Median :0.00000   Median :0.0000
 Mean   :0.3293   Mean   :0.1138   Mean   :0.08084   Mean   :0.0509
 3rd Qu.:1.0000   3rd Qu.:0.0000   3rd Qu.:0.00000   3rd Qu.:0.0000
 Max.   :1.0000   Max.   :1.0000   Max.   :1.00000   Max.   :1.0000
   Animation          Music             History          Documentary
 Min.   :0.0000   Min.   :0.000000   Min.   :0.000000   Min.   :0.000000
 1st Qu.:0.0000   1st Qu.:0.000000   1st Qu.:0.000000   1st Qu.:0.000000
 Median :0.0000   Median :0.000000   Median :0.000000   Median :0.000000
 Mean   :0.1048   Mean   :0.008982   Mean   :0.002994   Mean   :0.008982
 3rd Qu.:0.0000   3rd Qu.:0.000000   3rd Qu.:0.000000   3rd Qu.:0.000000
 Max.   :1.0000   Max.   :1.000000   Max.   :1.000000   Max.   :1.000000
      Wins          Nominations     Production.Budget   Worldwide
 Min.   :  0.000   Min.   :  0.00   Min.   : 9.703    Min.   :17.28
 1st Qu.:  1.000   1st Qu.:  4.00   1st Qu.:17.573    1st Qu.:19.04
 Median :  3.000   Median : 11.00   Median :18.381    Median :19.76
 Mean   :  8.449   Mean   : 16.85   Mean   :18.116    Mean   :19.65
 3rd Qu.:  9.750   3rd Qu.: 22.00   3rd Qu.:18.881    3rd Qu.:20.33
 Max.   :164.000   Max.   :106.00   Max.   :19.707    Max.   :21.82
#+end_example

Now we can split the dataset into two datasets in order to have both
training and testing datasets

#+begin_src R :session :results output :exports all
  writeLines("\n :: Building the training and testing sets:")

  MoviesTrain <- subset(Movies, Movies$Year <= 2009)
  writeLines("\n :: Number of observations in the training set:")
  nrow(MoviesTrain)

  MoviesTest <- subset(Movies, Movies$Year >= 2010)
  writeLines("\n :: Number of observations on the test set:")
  nrow(MoviesTest)
#+end_src

#+RESULTS:
:
:  :: Building the training and testing sets:
:
:  :: Number of observations in the training set:
: [1] 248
:
:  :: Number of observations on the test set:
: [1] 86

** DONE Problem 3 - A Linear Regression Model (1 point possible)
CLOSED: [2015-08-22 Sat 05:25]

Build a linear regression model to predict ~Worldwide~ based on all of
the remaining variables, except for Name and Year. Use the training
set to build the model. If your training set is called MoviesTrain, an
easy way to do this it to pass the argument

~data = MoviesTrain[ , 3:ncol(MoviesTrain)]~

to the lm function.

#+begin_src R :session :results output :exports all
  writeLines("\n :: Regression model to predict WorldWide revenue:")
  names(MoviesTrain)
  MoviesLinearReg <- lm(Worldwide ~ ., data = MoviesTrain[ , 3:ncol(MoviesTrain)])
  summary(MoviesLinearReg)
#+end_src

#+RESULTS:
#+begin_example

 :: Regression model to predict WorldWide revenue:
 [1] "Name"              "Year"              "Rated"
 [4] "Runtime"           "Action"            "Adventure"
 [7] "Crime"             "Drama"             "Thriller"
[10] "Fantasy"           "Horror"            "Sci.Fi"
[13] "Comedy"            "Family"            "Mystery"
[16] "Romance"           "Animation"         "Music"
[19] "History"           "Documentary"       "Wins"
[22] "Nominations"       "Production.Budget" "Worldwide"

Call:
lm(formula = Worldwide ~ ., data = MoviesTrain[, 3:ncol(MoviesTrain)])

Residuals:
    Min      1Q  Median      3Q     Max
-1.8311 -0.3893  0.0809  0.3906  1.6326

Coefficients:
                    Estimate Std. Error t value Pr(>|t|)
(Intercept)       15.9976766  1.1580192  13.815  < 2e-16 ***
RatedG             0.4102319  0.7041759   0.583 0.560774
RatedN/A           0.5562304  0.7322003   0.760 0.448258
RatedPG            0.7090507  0.6892058   1.029 0.304696
RatedPG-13         0.6027509  0.7107462   0.848 0.397322
RatedR             0.4127760  0.7210913   0.572 0.567608
Runtime            0.0097079  0.0032359   3.000 0.003007 **
Action             0.0172144  0.1333332   0.129 0.897389
Adventure         -0.2232011  0.1283551  -1.739 0.083432 .
Crime             -0.3315595  0.1473878  -2.250 0.025457 *
Drama             -0.2097674  0.1881216  -1.115 0.266029
Thriller          -0.1067814  0.1364400  -0.783 0.434682
Fantasy            0.1634927  0.1406340   1.163 0.246264
Horror            -0.6173923  0.2056864  -3.002 0.002993 **
Sci.Fi            -0.0147251  0.1353512  -0.109 0.913466
Comedy            -0.1431461  0.1611241  -0.888 0.375276
Family            -0.3206547  0.1780467  -1.801 0.073067 .
Mystery            0.1454495  0.1837735   0.791 0.429520
Romance           -0.0449227  0.2063239  -0.218 0.827840
Animation          0.6116779  0.2085349   2.933 0.003706 **
Music             -0.1531571  0.6860353  -0.223 0.823546
History           -1.3823299  0.6876694  -2.010 0.045624 *
Documentary       -0.4480795  0.4830499  -0.928 0.354620
Wins               0.0003704  0.0039940   0.093 0.926186
Nominations        0.0159878  0.0043745   3.655 0.000321 ***
Production.Budget  0.1104362  0.0550254   2.007 0.045962 *
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.6431 on 222 degrees of freedom
Multiple R-squared:  0.5413,	Adjusted R-squared:  0.4896
F-statistic: 10.48 on 25 and 222 DF,  p-value: < 2.2e-16
#+end_example

** DONE Problem 6 - An Updated Model (1 point possible)
CLOSED: [2015-08-22 Sat 06:45]

Create a new linear regression model on the training set with only the
significant variables you found in Problem 4 as the independent
variables. Going forward, we will only consider this linear regression
model.

#+begin_src R :session :results output :exports all
  writeLines("\n :: Subsetting the most significant features...")
  MoviesTrain <- MoviesTrain[, c(4, 7, 11, 17, 19, 22, 23, 24)]

  writeLines("\n :: Regression model to predict WorldWide revenue:")
  MoviesLinearReg2 <- lm(Worldwide ~ ., data = MoviesTrain)
  summary(MoviesLinearReg2)
#+end_src

#+RESULTS:
#+begin_example

 :: Subsetting the most significant features...

 :: Regression model to predict WorldWide revenue:

Call:
lm(formula = Worldwide ~ ., data = MoviesTrain)

Residuals:
     Min       1Q   Median       3Q      Max
-1.87336 -0.36913  0.07701  0.37701  1.93620

Coefficients:
                   Estimate Std. Error t value Pr(>|t|)
(Intercept)       15.531741   0.803224  19.337  < 2e-16 ***
Runtime            0.010095   0.002634   3.833 0.000162 ***
Crime             -0.293315   0.120701  -2.430 0.015829 *
Horror            -0.427419   0.141596  -3.019 0.002814 **
Animation          0.465257   0.166530   2.794 0.005629 **
History           -1.556980   0.650418  -2.394 0.017443 *
Nominations        0.017313   0.003010   5.751 2.68e-08 ***
Production.Budget  0.152527   0.046708   3.266 0.001252 **
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.6426 on 240 degrees of freedom
Multiple R-squared:  0.5048,	Adjusted R-squared:  0.4904
F-statistic: 34.95 on 7 and 240 DF,  p-value: < 2.2e-16
#+end_example

**** Answer

#+begin_src R :session :results output :exports all
  RT <- c(0, 1, 2, 3, 4, 5)
  a <- 0.010095
  WW <- a * RT
  WW
#+end_src

#+RESULTS:
: [1] 0.000000 0.010095 0.020190 0.030285 0.040380 0.050475

- [ ] For an additional unit of the variable Worldwide, the Runtime
  increases by approximately 0.01 minutes.

- [X] For an additional minute of Runtime, the prediction for the
  variable Worldwide increases by approximately 0.01 units.

- [ ] For each additional minute of Runtime, the variable Worldwide
  will definitely increase by approximately 0.01 units; thus,
  directors should strive to make their movies as long as possible.

*Explanation*

The coefficient should be interpreted as the change in the predicted
value of the dependent variable associated with a one unit change in
the independent variable. We cannot interpret the coefficient to imply
causality about the relationship between ~Runtime~ and ~Worldwide~.

** DONE Important change to the ~Movies~ dataset
CLOSED: [2015-08-22 Sat 11:01]

Now, remove the original dependent variable "Worldwide" from your
dataset with the command:

#+begin_src R :session :results output :exports all
  Movies$Worldwide <- NULL
  writeLines("\n :: Worldwide dependent variable removed...")
#+end_src

#+RESULTS:
:
:  :: Worldwide dependent variable removed...

Then, randomly split Movies into a training set, containing 70% of the
observations, and a testing set, containing 30% of the
observations. This time, you should use the sample.split function with
the dependent variable "Performance". Right before calling the
sample.split function, set the seed to 15071.

#+begin_src R :session :results output :exports all
  writeLines("\n :: Spliting the data set in a training and testing dataframes...")
  library(caTools)
  set.seed(15071)
  spl <- sample.split(Movies$Performance, SplitRatio = 0.7)
  MoviesTrain <- subset(Movies, spl == TRUE)
  MoviesTest <- subset(Movies, spl == FALSE)

  writeLines("\n :: Training dataset structure:")
  str(MoviesTrain)
#+end_src

#+RESULTS:
#+begin_example

 :: Spliting the data set in a training and testing dataframes...

 :: Training dataset structure:
'data.frame':	234 obs. of  24 variables:
 $ Name             : chr  "Batman" "Batman Forever" "Batman & Robin" "The Dark Knight" ...
 $ Year             : int  1989 1995 1997 2008 2012 2002 2006 2004 2003 2007 ...
 $ Rated            : Factor w/ 6 levels "Approved","G",..: 5 5 5 3 5 6 6 5 5 4 ...
 $ Runtime          : int  126 121 125 152 165 113 117 101 101 96 ...
 $ Action           : int  1 1 1 1 1 0 1 1 0 0 ...
 $ Adventure        : int  1 1 0 0 0 0 0 1 0 0 ...
 $ Crime            : int  0 0 0 1 0 0 0 0 0 0 ...
 $ Drama            : int  0 0 0 1 0 0 0 0 1 0 ...
 $ Thriller         : int  0 0 0 0 1 0 0 0 0 0 ...
 $ Fantasy          : int  0 1 0 0 0 0 1 0 1 1 ...
 $ Horror           : int  0 0 0 0 0 1 0 0 0 0 ...
 $ Sci.Fi           : int  0 0 0 0 0 0 0 1 0 0 ...
 $ Comedy           : int  0 0 0 0 0 0 0 0 1 1 ...
 $ Family           : int  0 0 0 0 0 0 0 0 0 1 ...
 $ Mystery          : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Romance          : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Animation        : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Music            : int  0 0 0 0 0 0 0 0 0 0 ...
 $ History          : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Documentary      : int  0 0 0 0 0 0 0 0 0 0 ...
 $ Wins             : int  10 9 5 134 43 10 12 2 7 2 ...
 $ Nominations      : int  21 20 20 106 83 25 30 2 7 10 ...
 $ Production.Budget: num  18.1 19.1 19.2 19.2 19.4 ...
 $ Performance      : Factor w/ 3 levels "Average","Excellent",..: 2 1 1 2 2 3 1 1 1 1 ...
#+end_example

Now, it is important that all the character features are classified as
factors in order to apply the algorithm

#+begin_src R :session :results output :exports all
  writeLines("\n :: Converting the Name feature to a factor type...")
  Movies$Name <- as.factor(Movies$Name)
  str(Movies$Name)
#+end_src

#+RESULTS:
:
:  :: Converting the Name feature to a factor type...
:  Factor w/ 334 levels "2 Fast 2 Furious",..: 28 32 31 29 30 247 248 4 5 6 ...

** DONE Problem 12 - Training Set Accuracy (1 point possible)
CLOSED: [2015-08-24 Mon 06:13]

Make predictions on the training set, and then create a confusion
matrix.

#+begin_src R :session :results output :exports all
  writeLines("\n :: Predicting the outcomes...")
  PredictTrainCART <- predict(MoviesCART, data = MoviesTrain[ ,
                                        3:ncol(MoviesTrain)], type = "class")

  writeLines("\n :: We can see the confusion matrix:")
  c <- table(MoviesTrain$Performance, PredictTrainCART)
  c

  writeLines("\n :: Overall Accuracy:")
  (c[1, 1] + c[2, 2] + c[3, 3]) / nrow(MoviesTrain)
#+end_src

#+RESULTS:
#+begin_example

 :: Predicting the outcomes...

 :: We can see the confusion matrix:
           PredictTrainCART
            Average Excellent Poor
  Average        96         9   11
  Excellent      17        41    1
  Poor           11         2   46

 :: Overall Accuracy:
[1] 0.7820513
#+end_example

**** Answer

#+begin_src R :session :results output :exports all
  writeLines("\n :: Predicting the outcomes...")
  PredictCART <- predict(MoviesCART, newdata = MoviesTest [ ,
                                        3:ncol(MoviesTest)], type = "class")

  writeLines("\n :: We can see the confusion matrix:")
  c <- table(MoviesTest$Performance, PredictCART)
  c

  writeLines("\n :: Overall accuracy:")
  (c[1, 1] + c[2, 2] + c[3, 3]) / nrow(MoviesTest)
#+end_src

#+RESULTS:
#+begin_example

 :: Predicting the outcomes...

 :: We can see the confusion matrix:
           PredictCART
            Average Excellent Poor
  Average        36         8    6
  Excellent       9        16    0
  Poor            8         1   16

 :: Overall accuracy:
[1] 0.68
#+end_example

** DONE Problem 1: Loading the Data (1 point possible)
CLOSED: [2015-08-24 Mon 07:07]

Use the read.csv function to load the contents of federalFundsRate.csv
into a data frame called ~fedFunds~, using ~stringsAsFactors=FALSE~.

#+begin_src R :session :results output :exports all
  library(parallel)

  if(!file.exists("../data")) {
          dir.create("../data")
  }

  fileUrl <- "https://courses.edx.org/asset-v1:MITx+15.071x_2a+2T2015+type@asset+block/federalFundsRate.csv"
  fileName <- "federalFundsRate.csv"
  dataPath <- "../data"

  filePath <- paste(dataPath, fileName, sep = "/")

  if(!file.exists(filePath)) {
          download.file(fileUrl, destfile = filePath, method = "curl")
  }

  writeLines("\n :: File downloaded...")

#+end_src

#+RESULTS:
:
:  :: File downloaded...

Now we can load the data set in a new dataframe

#+begin_src R :session :results output :exports all
  writeLines("\n :: Loading the Federal Funds Rate in a dataframe...")
  fedFunds <- read.csv("../data/federalFundsRate.csv", stringsAsFactors
                       = FALSE)
  str(fedFunds)
#+end_src

#+RESULTS:
#+begin_example

 :: Loading the Federal Funds Rate in a dataframe...
'data.frame':	585 obs. of  12 variables:
 $ Date               : chr  "1966-02-01" "1966-03-01" "1966-04-01" "1966-05-01" ...
 $ Chairman           : chr  "Martin, William M." "Martin, William M." "Martin, William M." "Martin, William M." ...
 $ PreviousRate       : num  4.42 4.6 4.65 4.67 4.9 5.17 5.3 5.53 5.4 5.53 ...
 $ Streak             : int  4 5 6 7 8 9 10 11 -1 1 ...
 $ GDP                : num  4202 4202 4202 4219 4219 ...
 $ Unemployment       : num  4 3.8 3.8 3.8 3.9 3.8 3.8 3.8 3.7 3.7 ...
 $ CPI                : num  31.9 32.1 32.2 32.3 32.4 ...
 $ HomeownershipRate  : num  63.5 63.5 63.5 63.2 63.2 63.2 63.3 63.3 63.3 63.8 ...
 $ DebtAsPctGDP       : num  40.3 4201.9 4201.9 39.2 4219.1 ...
 $ DemocraticPres     : int  1 1 1 1 1 1 1 1 1 1 ...
 $ MonthsUntilElection: int  33 32 31 30 29 28 27 26 25 24 ...
 $ RaisedFedFunds     : int  1 1 1 1 1 1 1 0 1 1 ...
#+end_example

Lets convert the ~Date~ feature to a ~date~ R type

#+begin_src R :session :results output :exports all
  writeLines("\n :: Converting to a date R type...")
  fedFunds$Date <- strptime(fedFunds$Date, format = "%Y-%m-%d")
  str(fedFunds)
#+end_src

#+RESULTS:
#+begin_example

 :: Converting to a date R type...
'data.frame':	585 obs. of  12 variables:
 $ Date               : POSIXlt, format: "1966-02-01" "1966-03-01" ...
 $ Chairman           : chr  "Martin, William M." "Martin, William M." "Martin, William M." "Martin, William M." ...
 $ PreviousRate       : num  4.42 4.6 4.65 4.67 4.9 5.17 5.3 5.53 5.4 5.53 ...
 $ Streak             : int  4 5 6 7 8 9 10 11 -1 1 ...
 $ GDP                : num  4202 4202 4202 4219 4219 ...
 $ Unemployment       : num  4 3.8 3.8 3.8 3.9 3.8 3.8 3.8 3.7 3.7 ...
 $ CPI                : num  31.9 32.1 32.2 32.3 32.4 ...
 $ HomeownershipRate  : num  63.5 63.5 63.5 63.2 63.2 63.2 63.3 63.3 63.3 63.8 ...
 $ DebtAsPctGDP       : num  40.3 4201.9 4201.9 39.2 4219.1 ...
 $ DemocraticPres     : int  1 1 1 1 1 1 1 1 1 1 ...
 $ MonthsUntilElection: int  33 32 31 30 29 28 27 26 25 24 ...
 $ RaisedFedFunds     : int  1 1 1 1 1 1 1 0 1 1 ...
#+end_example

**** Answer

#+begin_src R :session :results output :exports all
  writeLines("\n :: Chairman with the most numerous interest rate decisions:")
  table(fedFunds$Chairman)

  writeLines("\n :: By raised decisions:")
  table(fedFunds$Chairman, fedFunds$RaisedFedFunds)
#+end_src

#+RESULTS:
#+begin_example

 :: Chairman with the most numerous interest rate decisions:

     Bernanke, Ben      Burns, Arthur    Greenspan, Alan Martin, William M.
                96                 96                221                 48
Miller, G. William                N/A      Volcker, Paul      Yellen, Janet
                17                  2                 96                  9

 :: By raised decisions:

                       0   1
  Bernanke, Ben       64  32
  Burns, Arthur       46  50
  Greenspan, Alan    111 110
  Martin, William M.  16  32
  Miller, G. William   2  15
  N/A                  0   2
  Volcker, Paul       46  50
  Yellen, Janet        6   3
#+end_example

- [ ] Ben Bernanke
- [ ] Arthur Burns
- [X] Alan Greenspan
- [ ] William M. Martin
- [ ] G. William Miller
- [ ] Paul Volcker
- [ ] Janet Yellen

*Explanation*

This can be determined with the table or summary functions.

** DONE Problem 3 - Converting Variables to Factors (1 point possible)
CLOSED: [2015-08-24 Mon 08:38]

Convert the following variables to factors using the ~as.factor~
function:

- Chairman
- DemocraticPres
- RaisedFedFunds

#+begin_src R :session :results output :exports all
  writeLines("\n :: Converting Chairman, DemocraticPres, RaisedFedFunds to R type factor...")
  fedFunds$Chairman <- as.factor(fedFunds$Chairman)
  fedFunds$DemocraticPres <- as.factor(fedFunds$DemocraticPres)
  fedFunds$RaisedFedFunds <- as.factor(fedFunds$RaisedFedFunds)

  str(fedFunds)
#+end_src

#+RESULTS:
#+begin_example

 :: Converting Chairman, DemocraticPres, RaisedFedFunds to R type factor...
'data.frame':	585 obs. of  12 variables:
 $ Date               : POSIXlt, format: "1966-02-01" "1966-03-01" ...
 $ Chairman           : Factor w/ 8 levels "Bernanke, Ben",..: 4 4 4 4 4 4 4 4 4 4 ...
 $ PreviousRate       : num  4.42 4.6 4.65 4.67 4.9 5.17 5.3 5.53 5.4 5.53 ...
 $ Streak             : int  4 5 6 7 8 9 10 11 -1 1 ...
 $ GDP                : num  4202 4202 4202 4219 4219 ...
 $ Unemployment       : num  4 3.8 3.8 3.8 3.9 3.8 3.8 3.8 3.7 3.7 ...
 $ CPI                : num  31.9 32.1 32.2 32.3 32.4 ...
 $ HomeownershipRate  : num  63.5 63.5 63.5 63.2 63.2 63.2 63.3 63.3 63.3 63.8 ...
 $ DebtAsPctGDP       : num  40.3 4201.9 4201.9 39.2 4219.1 ...
 $ DemocraticPres     : Factor w/ 2 levels "0","1": 2 2 2 2 2 2 2 2 2 2 ...
 $ MonthsUntilElection: int  33 32 31 30 29 28 27 26 25 24 ...
 $ RaisedFedFunds     : Factor w/ 2 levels "0","1": 2 2 2 2 2 2 2 1 2 2 ...
#+end_example

** DONE Problem 5 - Training a Logistic Regression Model (1 point possible)
CLOSED: [2015-08-24 Mon 09:17]

Train a logistic regression model using independent variables
~PreviousRate~, ~Streak~, ~Unemployment~, ~HomeownershipRate~,
~DemocraticPres~, and ~MonthsUntilElection~, using the training set to
obtain the model.

#+begin_src R :session :results output :exports all
  writeLines("\n :: Building a Logistic Regression model...")
  glmFFRFit <- glm(RaisedFedFunds ~ PreviousRate + Streak + Unemployment +
                   HomeownershipRate + DemocraticPres +
                   MonthsUntilElection, data = training, family = "binomial")

  summary(glmFFRFit)
#+end_src

#+RESULTS:
#+begin_example

 :: Building a Logistic Regression model...

Call:
glm(formula = RaisedFedFunds ~ PreviousRate + Streak + Unemployment +
    HomeownershipRate + DemocraticPres + MonthsUntilElection,
    family = "binomial", data = training)

Deviance Residuals:
    Min       1Q   Median       3Q      Max
-2.8177  -1.0121   0.2301   1.0491   2.5297

Coefficients:
                     Estimate Std. Error z value Pr(>|z|)
(Intercept)          9.121012   5.155774   1.769   0.0769 .
PreviousRate        -0.003427   0.032350  -0.106   0.9156
Streak               0.157658   0.025147   6.270 3.62e-10 ***
Unemployment        -0.047449   0.065438  -0.725   0.4684
HomeownershipRate   -0.136451   0.076872  -1.775   0.0759 .
DemocraticPres1      0.347829   0.233200   1.492   0.1358
MonthsUntilElection -0.006931   0.007678  -0.903   0.3666
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

(Dispersion parameter for binomial family taken to be 1)

    Null deviance: 568.37  on 409  degrees of freedom
Residual deviance: 492.69  on 403  degrees of freedom
AIC: 506.69

Number of Fisher Scoring iterations: 4
#+end_example

Which of the following characteristics are statistically significantly
(p < 0.05, aka at least a * in the regression summary) associated with
an increased chance of the federal funds rate being raised?

- [ ] A higher federal funds rate in the previous month.

- [X] A longer consecutive streak of months in which the federal funds
  rate was raised.

- [ ] A higher unemployment rate.

- [ ] A higher rate of homeownership.

- [ ] The current president being a Democrat.

- [ ] A longer amount of time until the next presidential election.

*Explanation*

The model can be trained with the glm function (remember the argument
family = "binomial") and summarized with the ~summary~ function.

**** Answer

#+begin_src R :session :results output :exports all
  writeLines("\n :: Meaning of DemocraticPres as factor:")
  str(training$DemocraticPres)
  summary(training$DemocraticPres)

  writeLines("\n :: Summary of the logistic regression model:")
  summary(glmFFRFit)

  writeLines("\n :: Converting to a linear quantities:")
  exp(0.347829)
#+end_src

#+RESULTS:
#+begin_example

 :: Meaning of DemocraticPres as factor:
 Factor w/ 2 levels "0","1": 2 2 2 2 2 2 2 2 2 2 ...
  0   1
228 182

 :: Summary of the logistic regression model:

Call:
glm(formula = RaisedFedFunds ~ PreviousRate + Streak + Unemployment +
    HomeownershipRate + DemocraticPres + MonthsUntilElection,
    family = "binomial", data = training)

Deviance Residuals:
    Min       1Q   Median       3Q      Max
-2.8177  -1.0121   0.2301   1.0491   2.5297

Coefficients:
                     Estimate Std. Error z value Pr(>|z|)
(Intercept)          9.121012   5.155774   1.769   0.0769 .
PreviousRate        -0.003427   0.032350  -0.106   0.9156
Streak               0.157658   0.025147   6.270 3.62e-10 ***
Unemployment        -0.047449   0.065438  -0.725   0.4684
HomeownershipRate   -0.136451   0.076872  -1.775   0.0759 .
DemocraticPres1      0.347829   0.233200   1.492   0.1358
MonthsUntilElection -0.006931   0.007678  -0.903   0.3666
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

(Dispersion parameter for binomial family taken to be 1)

    Null deviance: 568.37  on 409  degrees of freedom
Residual deviance: 492.69  on 403  degrees of freedom
AIC: 506.69

Number of Fisher Scoring iterations: 4

 :: Converting to a linear quantities:
[1] 1.41599
#+end_example

- [ ] When the president is Democratic, the odds of the federal funds
  rate increasing are 34.8% higher than in an otherise identical month
  (i.e. identical among the variables in the model).

- [ ] When the president is Democratic, the odds of the federal funds
  rate increasing are 34.8% higher than in an average month in the
  dataset.

- [X] When the president is Democratic, the odds of the federal funds
  rate increasing are 41.6% higher than in an otherise identical month
  (i.e. identical among the variables in the model).

- [ ] When the president is Democratic, the odds of the federal funds
  rate increasing are 41.6% higher than in an average month in the
  dataset.

*Explanation*

The coefficients of the model are the log odds associated with that
variable; so we see that the odds of being sold are
exp(0.347829)=1.41599 those of an otherwise identical month. This
means the month is predicted to have 41.6% higher odds of being sold.

** DONE Problem 8 - Obtaining Test Set Predictions (2 points possible)
CLOSED: [2015-08-24 Mon 10:19]

Using your logistic regression model, obtain predictions on the test
set. Then, using a probability threshold of 0.5, create a confusion
matrix for the test set.

#+begin_src R :session :results output :exports all
  writeLines("\n :: The naive baseline model accuracy:")
  c <- table(testing$RaisedFedFunds)
  c
  c[2] / (c[1] + c[2])

  writeLines("\n :: The testing set accuracy:")
  ffrTestingPred <- predict(glmFFRFit, newdata = testing, type = "response")
  f <- table(testing$RaisedFedFunds, ffrTestingPred >= 0.5)
  f

  writeLines("\n :: The number of different predictions of the Logistic Reg
  model vs. Naive Baseline:")
  nrow(testing) - (f[1, 2] + f[2, 2])

  writeLines("\n :: The overall accuracy in the testing set:")
  (f[1, 1] + f[2, 2]) / nrow(testing)
#+end_src

#+RESULTS:
#+begin_example

 :: The naive baseline model accuracy:

 0  1
87 88
        1
0.5028571

 :: The testing set accuracy:

    FALSE TRUE
  0    60   27
  1    31   57

 :: The number of different predictions of the Logistic Reg
model vs. Naive Baseline:
[1] 91

 :: The overall accuracy in the testing set:
[1] 0.6685714
#+end_example

**** Answer

#+begin_src R :session :results output :exports all
  writeLines("\n :: Install package only once")
  ## install.packages('ROCR', repos='http://cran.rstudio.com/')
  library(ROCR)

  writeLines("\n :: Prediction function")
  ROCRpred <- prediction(ffrTestingPred, testing$RaisedFedFunds)

  writeLines("\n :: The AUC for the prediction function:")
  as.numeric(performance(ROCRpred, "auc")@y.values)
#+end_src

#+RESULTS:
#+begin_example

 :: Install package only once
Loading required package: gplots

Attaching package: ‘gplots’

The following object is masked from ‘package:stats’:

    lowess

 :: Prediction function

 :: The AUC for the prediction function:
[1] 0.704023
#+end_example

The AUC for the prediction function in the testing set: 0.704023

*Explanation*

The test-set AUC can be obtained by loading the ROCR package, and then
using the prediction and performance functions.

** DONE Problem 14 - Cross-Validation for a CART Model (1 point possible)
CLOSED: [2015-08-24 Mon 12:07]

Set the random seed to 201 (even though you have already done so
earlier in the problem). Then use the caret package and the train
function to perform 10-fold cross validation with the training data
set to select the best cp value for a CART model that predicts the
dependent variable ~RaisedFedFunds~ using the independent variables
~PreviousRate~, ~Streak~, ~Unemployment~, ~HomeownershipRate~,
~DemocraticPres~, and ~MonthsUntilElection~. Select the cp value from
a grid consisting of the 50 values 0.001, 0.002, ..., 0.05.

Performing the control parameter for the K-fold cross validation

#+begin_src R :session :results output :exports all
  library(caret)
  writeLines("\n :: Define cross-validation experiment...")
  numFolds <- trainControl(method = "cv", number = 10)
  cpGrid <- expand.grid(.cp = seq(0.001, 0.05, 0.001))
#+end_src

#+RESULTS:
: Loading required package: lattice
:
:  :: Define cross-validation experiment...

#+begin_src R :session :results output :exports all
  writeLines("\n :: Perform the cross validation:")
  set.seed(201)
  train(RaisedFedFunds ~ PreviousRate + Streak + Unemployment +
                HomeownershipRate + DemocraticPres +
                MonthsUntilElection, data = training, method = "rpart",
        trControl = numFolds, tuneGrid = cpGrid)
#+end_src

#+RESULTS:
#+begin_example

 :: Perform the cross validation:
 CART

410 samples
 11 predictor
  2 classes: '0', '1'

No pre-processing
Resampling: Cross-Validated (10 fold)
Summary of sample sizes: 368, 368, 368, 370, 369, 369, ...
Resampling results across tuning parameters:

  cp     Accuracy   Kappa      Accuracy SD  Kappa SD
  0.001  0.6221312  0.2448321  0.07032469   0.1404483
  0.002  0.6221312  0.2448321  0.07032469   0.1404483
  0.003  0.6365331  0.2734338  0.07269107   0.1452330
  0.004  0.6340331  0.2684338  0.07989234   0.1596618
  0.005  0.6340331  0.2684338  0.07989234   0.1596618
  0.006  0.6487921  0.2980610  0.07527713   0.1506483
  0.007  0.6487921  0.2980610  0.07527713   0.1506483
  0.008  0.6487921  0.2980610  0.07527713   0.1506483
  0.009  0.6537311  0.3080170  0.07647219   0.1530306
  0.010  0.6537311  0.3080170  0.07647219   0.1530306
  0.011  0.6583101  0.3173385  0.08708649   0.1745233
  0.012  0.6583101  0.3173385  0.08708649   0.1745233
  0.013  0.6583101  0.3173385  0.08708649   0.1745233
  0.014  0.6632491  0.3272594  0.08455690   0.1695616
  0.015  0.6632491  0.3272594  0.08455690   0.1695616
  0.016  0.6632491  0.3272594  0.08455690   0.1695616
  0.017  0.6609901  0.3231241  0.08079685   0.1618307
  0.018  0.6609901  0.3231241  0.08079685   0.1618307
  0.019  0.6609901  0.3231241  0.08079685   0.1618307
  0.020  0.6560511  0.3137948  0.07942067   0.1592573
  0.021  0.6512892  0.3042710  0.08322242   0.1669492
  0.022  0.6437892  0.2892710  0.07911989   0.1589478
  0.023  0.6437892  0.2892710  0.07911989   0.1589478
  0.024  0.6583130  0.3183186  0.08348418   0.1673133
  0.025  0.6583130  0.3183186  0.08348418   0.1673133
  0.026  0.6583130  0.3183186  0.08348418   0.1673133
  0.027  0.6583130  0.3183186  0.08348418   0.1673133
  0.028  0.6583130  0.3183186  0.08348418   0.1673133
  0.029  0.6583130  0.3183186  0.08348418   0.1673133
  0.030  0.6583130  0.3183186  0.08348418   0.1673133
  0.031  0.6583130  0.3183186  0.08348418   0.1673133
  0.032  0.6583130  0.3183186  0.08348418   0.1673133
  0.033  0.6583130  0.3183186  0.08348418   0.1673133
  0.034  0.6583130  0.3183186  0.08348418   0.1673133
  0.035  0.6583130  0.3183186  0.08348418   0.1673133
  0.036  0.6583130  0.3183186  0.08348418   0.1673133
  0.037  0.6583130  0.3183186  0.08348418   0.1673133
  0.038  0.6583130  0.3183186  0.08348418   0.1673133
  0.039  0.6583130  0.3183186  0.08348418   0.1673133
  0.040  0.6583130  0.3183186  0.08348418   0.1673133
  0.041  0.6583130  0.3183186  0.08348418   0.1673133
  0.042  0.6583130  0.3183186  0.08348418   0.1673133
  0.043  0.6583130  0.3183186  0.08348418   0.1673133
  0.044  0.6583130  0.3183186  0.08348418   0.1673133
  0.045  0.6583130  0.3183186  0.08348418   0.1673133
  0.046  0.6583130  0.3183186  0.08348418   0.1673133
  0.047  0.6583130  0.3183186  0.08348418   0.1673133
  0.048  0.6583130  0.3183186  0.08348418   0.1673133
  0.049  0.6583130  0.3183186  0.08348418   0.1673133
  0.050  0.6583130  0.3183186  0.08348418   0.1673133

Accuracy was used to select the optimal model using  the largest value.
The final value used for the model was cp = 0.016.
#+end_example

What cp value maximizes the cross-validation accuracy?

**** Answer

#+begin_src R :session :results output :exports all
  min(subset(houseHolds, houseHolds$AvgDiscount > 25)$AvgSalesValue)
#+end_src

#+RESULTS:
: [1] 50.1175

*** Question c

In the dataset, what proportion of households visited the retailer at
least 300 times?

#+begin_src R :session :results output :exports all
  nrow(subset(houseHolds, houseHolds$NumVisits >= 300)) / nrow(houseHolds)
#+end_src

#+RESULTS:
: [1] 0.0592

*Explanation*

You can first use subset to create a dataframe called HighSpender that
only includes households with average transaction value greater
than 150. Then, use the min() function to see the value of
AvgDiscount. The second question is similar. For the third question,
we see that there are 148 such households. The proportion is thus
$148 / 2500$.

**** Answer

#+begin_src R :session :results output :exports all
  summary(houseHolds)
#+end_src

#+RESULTS:
#+begin_example
   NumVisits       AvgProdCount     AvgDiscount     AvgSalesValue
 Min.   :   1.0   Min.   : 1.186   Min.   : 0.089   Min.   :  2.388
 1st Qu.:  39.0   1st Qu.: 6.123   1st Qu.: 3.006   1st Qu.: 18.329
 Median :  79.0   Median : 8.979   Median : 4.865   Median : 27.417
 Mean   : 110.6   Mean   :10.291   Mean   : 5.713   Mean   : 31.621
 3rd Qu.: 142.2   3rd Qu.:13.116   3rd Qu.: 7.327   3rd Qu.: 40.546
 Max.   :1300.0   Max.   :56.600   Max.   :47.176   Max.   :165.829
   MorningPct      AfternoonPct       NightPct
 Min.   :  0.00   Min.   :  0.00   Min.   :  0.000
 1st Qu.: 16.67   1st Qu.: 42.20   1st Qu.:  7.692
 Median : 26.09   Median : 52.00   Median : 16.920
 Mean   : 28.73   Mean   : 51.45   Mean   : 19.817
 3rd Qu.: 37.17   3rd Qu.: 61.29   3rd Qu.: 28.523
 Max.   :100.00   Max.   :100.00   Max.   :100.000
#+end_example

- [X] NumVisits
- [ ] AvgProdCount
- [ ] AvgDiscount
- [ ] AvgSalesValue
- [ ] MorningPct
- [ ] AfternoonPct

*Explanation*

We would expect NumVisits to dominate, because it is on the largest
scale.

** DONE Problem 4 - Normalizing the Data (2 points possible)
CLOSED: [2015-08-24 Mon 14:40]

Normalize all of the variables in the Hubway dataset by entering the
following commands in your R console: (Note that these commands assume
that your dataset is called "Households", and create the normalized
dataset "HouseholdsNorm". You can change the names to anything you
want by editing the commands.)

#+begin_src R :session :results output :exports all
  library(caret)
  houseHolds$NightPct <- NULL
  preproc <- preProcess(houseHolds)
  HouseholdsNorm <- predict(preproc, houseHolds)
  summary(HouseholdsNorm)
#+end_src

#+RESULTS:
#+begin_example
   NumVisits        AvgProdCount      AvgDiscount      AvgSalesValue
 Min.   :-0.9475   Min.   :-1.5239   Min.   :-1.4010   Min.   :-1.5342
 1st Qu.:-0.6190   1st Qu.:-0.6976   1st Qu.:-0.6743   1st Qu.:-0.6976
 Median :-0.2731   Median :-0.2197   Median :-0.2112   Median :-0.2206
 Mean   : 0.0000   Mean   : 0.0000   Mean   : 0.0000   Mean   : 0.0000
 3rd Qu.: 0.2737   3rd Qu.: 0.4728   3rd Qu.: 0.4021   3rd Qu.: 0.4684
 Max.   :10.2828   Max.   : 7.7500   Max.   :10.3293   Max.   : 7.0432
   MorningPct       AfternoonPct
 Min.   :-1.6779   Min.   :-3.22843
 1st Qu.:-0.7047   1st Qu.:-0.58006
 Median :-0.1546   Median : 0.03458
 Mean   : 0.0000   Mean   : 0.00000
 3rd Qu.: 0.4926   3rd Qu.: 0.61755
 Max.   : 4.1617   Max.   : 3.04658
#+end_example

(Remember that for each variable, the normalization process subtracts
the mean and divides by the standard deviation. We learned how to do
this in Unit 6.) In your normalized dataset, all of the variables
should have mean 0 and standard deviation 1.

** DONE Problem 6 - K-means Clustering (2 points possible)
CLOSED: [2015-08-24 Mon 17:26]

Run the k-means clustering algorithm on your normalized dataset,
selecting 10 clusters. Right before using the kmeans function, type
~set.seed(200)~ in your R console.

#+begin_src R :session :results output :exports all
  k = 10
  set.seed(200)
  KMC <- kmeans(HouseholdsNorm, 10)
  str(KMC)

  sort(table(KMC$cluster), decreasing = TRUE)
#+end_src

#+RESULTS:
#+begin_example
 ..$ : chr [1:10] "1" "2" "3" "4" ...
  .. ..$ : chr [1:6] "NumVisits" "AvgProdCount" "AvgDiscount" "AvgSalesValue" ...
 $ totss       : num 14994
 $ withinss    : num [1:10] 628 449 700 282 580 ...
 $ tot.withinss: num 4828
 $ betweenss   : num 10166
 $ size        : int [1:10] 246 51 490 118 504 226 141 284 52 388
 $ iter        : int 5
 $ ifault      : int 0
 - attr(*, "class")= chr "kmeans"

  5   3  10   8   1   6   7   4   9   2
504 490 388 284 246 226 141 118  52  51
#+end_example

*** Question

Which cluster best fits the description "morning shoppers stopping in
to make a quick purchase"?

#+begin_src R :session :results output :exports all
  writeLines("\n :: Subsetting each cluster content...")
  KmeansCluster = split(HouseholdsNorm, KMC$cluster)

  writeLines("\n :: MorningPct for cluster 1:")
  mean(KmeansCluster[[1]]$MorningPct)

  writeLines("\n :: MorningPct for cluster 2:")
  mean(KmeansCluster[[2]]$MorningPct)

  writeLines("\n :: MorningPct for cluster 3:")
  mean(KmeansCluster[[3]]$MorningPct)

  writeLines("\n :: MorningPct for cluster 4:")
  mean(KmeansCluster[[4]]$MorningPct)

  writeLines("\n :: MorningPct for cluster 5:")
  mean(KmeansCluster[[5]]$MorningPct)

  writeLines("\n :: MorningPct for cluster 6:")
  mean(KmeansCluster[[6]]$MorningPct)

  writeLines("\n :: MorningPct for cluster 7:")
  mean(KmeansCluster[[7]]$MorningPct)

  writeLines("\n :: MorningPct for cluster 8:")
  mean(KmeansCluster[[8]]$MorningPct)

  writeLines("\n :: MorningPct for cluster 9:")
  mean(KmeansCluster[[9]]$MorningPct)

  writeLines("\n :: MorningPct for cluster 10:")
  mean(KmeansCluster[[10]]$MorningPct)
#+end_src

#+RESULTS:
#+begin_example

 :: Subsetting each cluster content...

 :: MorningPct for cluster 1:
[1] -0.3484055

 :: MorningPct for cluster 2:
[1] 0.1998456

 :: MorningPct for cluster 3:
[1] -0.1824442

 :: MorningPct for cluster 4:
[1] 2.491061

 :: MorningPct for cluster 5:
[1] -0.5470039

 :: MorningPct for cluster 6:
[1] 0.06527668

 :: MorningPct for cluster 7:
[1] 1.444041

 :: MorningPct for cluster 8:
[1] -0.8983063

 :: MorningPct for cluster 9:
[1] -0.238993

 :: MorningPct for cluster 10:
[1] 0.5047486
#+end_example

** DONE Problem 12 - Increasing the Number of Clusters (2 points possible)
CLOSED: [2015-08-24 Mon 18:34]

Run the k-means clustering algorithm again, this time selecting 5
clusters. Right before the "kmeans" function, set the random seed
to 5000.

#+begin_src R :session :results output :exports all
  k = 5
  set.seed(5000)
  KMC2 <- kmeans(HouseholdsNorm, k)
  str(KMC2)

  sort(table(KMC2$cluster), decreasing = TRUE)
#+end_src

#+RESULTS:
#+begin_example
 ..$ : chr [1:5] "1" "2" "3" "4" ...
  .. ..$ : chr [1:6] "NumVisits" "AvgProdCount" "AvgDiscount" "AvgSalesValue" ...
 $ totss       : num 14994
 $ withinss    : num [1:5] 1264 1838 1336 754 1604
 $ tot.withinss: num 6795
 $ betweenss   : num 8199
 $ size        : int [1:5] 182 994 428 172 724
 $ iter        : int 7
 $ ifault      : int 0
 - attr(*, "class")= chr "kmeans"

  2   5   3   1   4
994 724 428 182 172
#+end_example

*** Answer

#+begin_src R :session :results output :exports all
  summary(KmeansCluster2[[1]]$NumVisits)
#+end_src

#+RESULTS:
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
: -0.9388 -0.7054 -0.5022 -0.3975 -0.1651  1.1100

- [X] A box plot of the variable NumVisits, subdivided by cluster

- [ ] A box plot of the clusters, subdivided by NumVisits values

- [ ] ~ggplot~ with the cluster number on the ~x-axis~ and ~NumVisits~
  on the ~y-axis~, plotting with ~geom_histogram()~

- [X] ~ggplot~ with ~NumVisits~ on the ~x-axis~ and the cluster number
  on the ~y-axis~, plotting with ~geom_point()~

*Explanation*

A box plot of NumVisits shows the distribution of the number of visits
of the households, and we want to subdivide by cluster. Alternatively,
ggplot with x as the cluster and y as the number of visits plots the
data, but only geom_point is appropriate to show the distribution of
the data.

